Revit 2027 API
CurveElement.SketchPlane Property
The sketch plane the curve element lies in.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual SketchPlane SketchPlane { get; set; }
Public Overridable Property SketchPlane As SketchPlane
	Get
	Set
public:
virtual property SketchPlane^ SketchPlane {
	SketchPlane^ get ();
	void set (SketchPlane^ value);
}
abstract SketchPlane : SketchPlane with get, set
override SketchPlane : SketchPlane with get, set
Property Value
SketchPlane
Exceptions
Exception | Condition
ArgumentNullException |  Thrown if the argument is null.
InvalidOperationException |  Thrown if the CurveElement is CurveByPoints or belongs to a Path3d element. -- or -- Thrown if the sketch plane is set on a DetailCurve. --or-- Thrown if the sketch plane is not parallel to the existing plane. -- or -- Thrown if the sketch plane is not suitable. -- or -- Thrown if the CurveElement belongs to a sketch-based element. -- or -- Thrown if modifying the sketch plane is not allowed. -- or -- Thrown if the CurveElement cannot be moved out of its sketch plane.
Remarks
The new sketch plane must be parallel to the existing sketch plane. Setting this property is not permitted for detail curves because they must be placed only on view-specific planes.
See Also
Reference
CurveElement Class
Autodesk.Revit.DB Namespace